//------------------------------------------------------------------------------------------------------------
//
// facemaker_inc.h
//
// 2009-5-26 11:40:03
//
// sunny
//
//------------------------------------------------------------------------------------------------------------


#ifndef ___FACE_MAKER_INC_H____
#define ___FACE_MAKER_INC_H____    1

#include "../script_type.h"


//------------------------------------------------------------------------------------------------------------
//   资源数据偏移位置以RES_ALIGN(32 Byte)对齐
//------------------------------------------------------------------------------------------------------------
#define  RES_ALIGN_FUNC(X)      (((X) + (RES_ALIGN - 1)) & (~(RES_ALIGN - 1)))

#define  NULL_FILE_NAME         "NULL"


//------------------------------------------------------------------------------------------------------------
//   Buffer_t
//------------------------------------------------------------------------------------------------------------
#define  FACE_BUFFER_LEN        256 * 1024                  // Buffer长度 : 256K

typedef  struct tag_BUFFER
{
    void *Buffer;                                           // 缓冲区
    u32   BufferLen;                                        // 缓冲区长度
} FACE_BUFFER;


//------------------------------------------------------------------------------------------------------------
//   FACE_MAKER : 1024 Bytes
//------------------------------------------------------------------------------------------------------------
#pragma pack(push, 1)
typedef struct tag_FACE_MAKER
{
    FILE            *hResFile;                              // 资源文件句柄
    FILE            *hResHeadFile;                          // 头文件句柄
    char            ResFile[MAX_PATH];                      // 资源文件
    u8              Zero0;                                  // 隔离区
    char            ResHeadFile[MAX_PATH];                  // 资源头文件
    u8              Zero1;                                  // 隔离区
    FACE_SYS_INFO   *SysInfo;                               // 主题信息
    u32             resCount;                               // 资源个数
    FACE_RES_ITEM   *ResTable;                              // 资源信息表
    FACE_BUFFER     Buffer_t;                               // 数据缓冲区
    u8              Reserved[1024 - 2 * MAX_PATH - 22 - sizeof(FACE_BUFFER)];
} FACE_MAKER;
#pragma pack(pop)

#endif      // ___FACE_MAKER_INC_H____

