//----------------------------------------------------------------------------------------------------------//
//                                                                                                          //
// File    : config_info.h                                                                                  //
// By      : scottyu                                                                                        //
// Version : V1.00                                                                                          //
// Time    : 2009-12-23 16:54:24                                                                            //
//                                                                                                          //
//----------------------------------------------------------------------------------------------------------//


#ifndef __CONFIG_INFO_H__
#define __CONFIG_INFO_H__


#define SET_SYSTEM      "system"        // system section 关键字
#define KEY_VER         "ver"           //
#define KEY_DATE        "date"          //
#define KEY_ID          "ID"            //
#define KEY_ID_STR      "937ae0d0-50e3-43c2-9b84-bfef0cd21a41"

#define SET_FSINFO      "fsinfo"        // fsinfo section关键字
#define KEY_DISCCNT     "disccnt"       //
#define KEY_DISCN       "disc"          //

#define KEY_DISC        "disc"          //
#define KEY_FSNAME      "fsname"        //
#define KEY_FORMAT      "format"        //
#define KEY_SIZE        "size"          //
#define KEY_ATTR        "attr"          //
#define KEY_ROOTCOUNT       "rootcnt"       //
#define KEY_PCROOT      "root"          //

//#define KEY_MAKEDIR   "makedir"       //
//#define KEY_FILECOPY  "filecopy"      //

#define MAX_PATH 260
//------------------------------------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------------------------------------

#define DATE_LEN        32          //
#define GUID_LEN        36          //
#define PASSLEN         256         //

//------------------------------------------------------------------------------
//系统配置section
//------------------------------------------------------------------------------
typedef struct tag_CFG_SYSTEM
{
    u32         ver;                //脚本版本
    char        date[DATE_LEN];     //脚本日期
    char        GUID[GUID_LEN];     //ID字符串
    u32         res;                //保留
} CFG_SYSTEM;

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
typedef struct tag_DIR_ITEM
{
    char        dir[MAX_PATH];      //
} DIR_ITEM;

//------------------------------------------------------------------------------
// 建立目录相关信息
//------------------------------------------------------------------------------
typedef struct tag_MAKEDIR_INFO
{
    u32         cnt;                //需建立的目录个数
    DIR_ITEM   *dirArray;           //fs_path[i] 指向待建立目录路径, 如：c:\res\demo
} MAKEDIR;

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
typedef struct tag_FILE_ITEM
{
    char        pc_file[MAX_PATH];  //该文件在pc上面的路径
    char        fs_file[MAX_PATH];  //该文件在fs上面的路径
} FILE_ITEM;

//------------------------------------------------------------------------------
// 拷贝文件相关信息
//------------------------------------------------------------------------------
typedef struct tag_FILECOPY_INFO
{
    u32         cnt;                //需拷贝文件项数目
    FILE_ITEM *fileArray;           //
} FILECOPY;

//------------------------------------------------------------------------------
// 根目录的相关信息
//------------------------------------------------------------------------------
typedef struct tag_ROOTDIR_INFO
{
    u32         cnt;                //需建立的目录个数
    DIR_ITEM   *root;               //fs_path[i] 指向待建立目录路径, 如：c:\res\demo
} ROOTDIR;

//------------------------------------------------------------------------------
//一个文件系统
//------------------------------------------------------------------------------
typedef struct tag_FS_INFO
{
    char        disc[2];            //镜像盘符
    char        fsname[MAX_PATH];   //镜像文件输出文件名

    char        format[10];         //镜像文件格式
    u32         size;               //
    u32         attr;               //

    ROOTDIR     root_dir;           //待拷贝根目录

//  MAKEDIR     make_dir;           //镜像文件中需要建立的路径
//  FILECOPY    file_copy;          //镜像文件中需要拷贝的文件

} FS_INFO;

//------------------------------------------------------------------------------
//全部文件系统
//------------------------------------------------------------------------------
typedef struct tag_CFG_FSINFO
{
    u32         cnt;                //磁盘镜像个数
    FS_INFO    *fs;                 //磁盘镜像信息，动态数组
} CFG_FSINFO;


//------------------------------------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------------------------------------

#endif  //__CONFIG_INFO_H__

